Autodesk.Navisworks.Api.Schema.VectorFieldCollectionType
Represents collection metadata, including whether the collection is ordered, and whether the elements are unique.

Autodesk.Navisworks.Api.Schema.VectorFieldCollectionType.Unordered
Preserving element order is not important. (Default)

Autodesk.Navisworks.Api.Schema.VectorFieldCollectionType.Ordered
Preserving element order is important.

Autodesk.Navisworks.Api.Schema.VectorFieldCollectionType.UnorderedUnique
Preserving element order is not important and elements must be unique.

Autodesk.Navisworks.Api.Schema.VectorFieldCollectionType.OrderedUnique
Preserving element order is important and elements must be unique.